using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace OOP_Construction_of_Class
{//ООП
    /////////////////////////////////////////////////Конструктор класа///////////////////////////////////////////
    ///Конструктор це спеціальний метод класу, який визивається при створенні обєкту цього класу (new)
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("\t\tКонструктор без параметрів, створюється і відразу заряжається");
            Gun gun = new Gun();//Gun() сам конструктор класу
            gun.Shoot();//оскільки лише цей метод є Публічним, ми можемо лише вистрелити

            Console.WriteLine("\t\tКонструктор з параметром false (створюється НЕ заряженою)");
            Gun2 gun2=new Gun2(false);//Пушка буде створюватись НЕ заряженою
            //abo
            //Gun2 gun2 = new Gun2(isloaded:false);
            gun2.Shoot();

            Console.WriteLine("\t\tКонструктор з параметром true (створюється заряженою)");
            Gun2 gun3 = new Gun2(true);//Пушка буде створюватись НЕ заряженою
            //Gun3 gun3 = new Gun3(isloaded:true);
            gun3.Shoot();
            //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            //////////////////////////////////////////////////////////////Point///////////////////////////////////////////////////////////////////////
            //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            Point point = new Point(5,3);//при створені відразу передаємо координати по Х і по У
            point.Print();//запускаємо метод який отримує ці ж координати і відображає





            Console.ReadKey();
        }
    }
}
