using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace OOP_Metod_Class
{
    class Program
    {   //OOП
        //Методы обекта класса
        static Student GetStudent()//Щоб визвати метод GetStudent з типом static, клас взагалі не потрібний
        {
            Student student = new Student();
            student.id = Guid.NewGuid();
            student.firstName = "Vitaliy";
            student.lastName = "Kulik";
            student.middleName = "Olexiyovich";
            student.age = 23;
            student.group = "PM";
            return student;
        }



        
        static void Main(string[] args)
        {
            var firstStudent = GetStudent();// var змінна firstStudent присвоїти все з методу GetStudent
            firstStudent.Print();//Так виводимо якщо прописали сам метод в самому класі, тоді віддавати на метод нічогоне потрібно щоб отримати і вивести
            //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            Console.WriteLine("\n\n \tЯкщо визвати метод як наследник класа Student а не через метод GetStudent");
            //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            var secondStudent = new Student();
            secondStudent.Print();//отримаємо дефолтні значення для полів
            //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            Console.WriteLine("\n\n \tЯкщо визвати метод як наследник класа Student і вручну присвоєти значення в полі firstName = Vasiliy");
            //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            secondStudent.firstName = "Vasiliy";
            secondStudent.Print();
            //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            string full_name = firstStudent.GetFullName();//На рівні екземпляра Student визвем метод GetFullName


            //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            /////////////////////////////////////////////////////////////////Car//////////////////////////////////////////////////////////////////////////
            //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            Console.WriteLine("\n\n\n \t== Car1 ==");
            var car1 = new Car();
            car1.PrintSpeed();//виводимо першочергове значення швидкості             оскільки воно 0 тоді буде написано що стоїмо
            car1.DriveForward();//Заносимо значення 60 в змінну Speed
            car1.PrintSpeed();//Перевіряємо умови, згідно з якими виводимо що "Рухаємось зі швидкістю 60"
            car1.Stop();//заносимо значення 0 в змінну Speed
            car1.PrintSpeed();//Перевіряємо умови, згідно з якими виводимо що "машина стоїть"


            Console.WriteLine("\n \t== Car2 ==");
            var car2 = new Car();
            car2.PrintSpeed();//виводимо першочергове значення швидкості             оскільки воно 0 тоді буде написано що стоїмо
            car2.DriveBackward();//Заносимо значення -10 в змінну Speed
            car2.PrintSpeed();//Перевіряємо умови, згідно з якими виводимо що "Рухаємось зі назад зі швидкістю 10"
            car2.Stop();//заносимо значення 0 в змінну Speed
            car2.PrintSpeed();//Перевіряємо умови, згідно з якими виводимо що "машина стоїть"




            Console.ReadKey();
        }
    }
}
